** Implementation
:PROPERTIES:
:ID:       c2b8509a-4e0b-4158-b8ae-8cddf1b91c6b
:END:
My implementation starts with org-mode documents in Emacs, where
=metas= are created and updated. A directory, =~/org/meta= stores all
my meta files in a single location (including this one).

#+name: ~/org/meta
#+begin_src sh :eval never-export
ls ~/org/meta | head -n 5
#+end_src
#+RESULTS: ~/org/meta
| babel.org   |
| crater.org  |
| demo.org    |
| meta.org    |
| music.org   |


